papers/cdc17-1.html
---
layout: page
title: ! 'Sequential Detection in Adversarial Environment'
comments: true
---
<hr />
<p>
<b>Jiaqi Yan, Xiaoqiang Ren and Yilin Mo</b>
</p>

<p>
<i>IEEE Conference on Decision and Control</i>, 2017, Submitted
</p>

<p>
Link to the <a href="../../../public/papers/cdc17-1.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Fcdc17-1.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-org00be29b" class="outline-2">
<h2 id="org00be29b">Abstract</h2>
<div class="outline-text-2" id="text-org00be29b">
<p>
In this paper, we consider the problem of sequential detection with \(m\) sensors in adversarial environment. An attacker intends to increase the detection error by modifying \(n\) out of \(m\) sensors’ measurements. On the other hand, the detector needs to be designed to achieve the optimal performance during the attack. The problem is formulated as a game between detector and adversary in this paper. We study both cases where \(m > 2n\) and \(m \leq 2n\), and obtain an equilibrium strategy pair of detection rule and attack scheme for both cases. Furthermore, we investigate the efficiency of our proposed detection strategy in the absence of attacker.
</p>
</div>
</div>
